In [1]:
import pandas as pd
import re
import psycopg2
from sqlalchemy import create_engine
import warnings
warnings.filterwarnings("ignore")

In [2]:
##Psycopg2 connector

In [3]:

# SQLAlchemy connection string format:
# postgresql+psycopg2://user:password@host:port/dbname

DATABASE_URL = (
    "postgresql+psycopg2://neondb_owner:npg_CeS9fJg2azZD"
    "@ep-falling-glitter-a5m0j5gk-pooler.us-east-2.aws.neon.tech:5432/neondb"
    "?sslmode=require"
)

# Create engine and establish connection
engine = create_engine(DATABASE_URL)

In [4]:
import pandas as pd
df=pd.read_csv('/Users/sums/Documents/Webeet Internship/sat-results.csv')
df

,DBN,SCHOOL NAME,Num of SAT Test Takers,SAT Critical Reading Avg. Score,SAT Math Avg. Score,SAT Writing Avg. Score,SAT Critical Readng Avg. Score,internal_school_id,contact_extension,pct_students_tested,academic_tier_rating
0,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES,29,355,404,363,355,218160,x345,78%,2.0
1,01M448,UNIVERSITY NEIGHBORHOOD HIGH SCHOOL,91,383,423,366,383,268547,x234,NaN,3.0
2,01M450,EAST SIDE COMMUNITY SCHOOL,70,377,402,370,377,236446,x123,NaN,3.0
3,01M458,FORSYTH SATELLITE ACADEMY,7,414,401,359,414,427826,x123,92%,4.0
4,01M509,MARTA VALLE HIGH SCHOOL,44,390,433,384,390,672714,x123,92%,2.0
...,...,...,...,...,...,...,...,...,...,...,...
488,27Q480,JOHN ADAMS HIGH SCHOOL,403,391,409,392,391,863765,NaN,92%,1.0
489,13K605,GEORGE WESTINGHOUSE CAREER AND TECHNICAL EDUCA...,85,406,391,392,406,937579,x234,NaN,NaN
490,05M304,MOTT HALL HIGH SCHOOL,54,413,399,398,413,296405,x123,78%,2.0
491,02M520,MURRY BERGTRAUM HIGH SCHOOL FOR BUSINESS CAREERS,264,407,440,393,407,892839,NaN,92%,2.0
492,07X221,SOUTH BRONX PREPARATORY: A COLLEGE BOARD SCHOOL,65,364,378,348,364,277389,x345,92%,NaN

In [5]:
new_df=df.drop_duplicates()
new_df

,DBN,SCHOOL NAME,Num of SAT Test Takers,SAT Critical Reading Avg. Score,SAT Math Avg. Score,SAT Writing Avg. Score,SAT Critical Readng Avg. Score,internal_school_id,contact_extension,pct_students_tested,academic_tier_rating
0,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES,29,355,404,363,355,218160,x345,78%,2.0
1,01M448,UNIVERSITY NEIGHBORHOOD HIGH SCHOOL,91,383,423,366,383,268547,x234,NaN,3.0
2,01M450,EAST SIDE COMMUNITY SCHOOL,70,377,402,370,377,236446,x123,NaN,3.0
3,01M458,FORSYTH SATELLITE ACADEMY,7,414,401,359,414,427826,x123,92%,4.0
4,01M509,MARTA VALLE HIGH SCHOOL,44,390,433,384,390,672714,x123,92%,2.0
...,...,...,...,...,...,...,...,...,...,...,...
473,75X012,P.S. X012 LEWIS AND CLARK SCHOOL,s,s,s,s,s,733698,x234,92%,1.0
474,75X754,J. M. RAPPORT SCHOOL CAREER DEVELOPMENT,s,s,s,s,s,976034,x345,NaN,4.0
475,79M645,SCHOOL FOR COOPERATIVE TECHNICAL EDUCATION,s,s,s,s,s,556924,x123,85%,1.0
476,79Q950,GED PLUS s CITYWIDE,8,496,400,426,496,544514,x234,92%,2.0
477,79X490,PHOENIX ACADEMY,9,367,370,360,367,248647,x234,85%,NaN

In [6]:
# Clean and normalize column names
def clean_column(col):
    col = re.sub(r'[^A-Za-z0-9 _\.\-]', '', col)  # remove weird unicode chars
    col = col.strip().lower().replace(' ', '_')   # lowercase and snake_case
    return col

In [7]:
df.columns = [clean_column(col) for col in df.columns]

# Print cleaned columns
print(df.columns.tolist())

['dbn', 'school_name', 'num_of_sat_test_takers', 'sat_critical_reading_avg._score', 'sat_math_avg._score', 'sat_writing_avg._score', 'sat_critical_readng_avg._score', 'internal_school_id', 'contact_extension', 'pct_students_tested', 'academic_tier_rating']

In [8]:
#Drop irrelevant or duplicate columns
df.drop(columns=['sat_critical_readng_avg._score', 'internal_school_id', 
    'contact_extension'], errors='ignore', inplace=True)

In [9]:
df.columns

Index(['dbn', 'school_name', 'num_of_sat_test_takers',
       'sat_critical_reading_avg._score', 'sat_math_avg._score',
       'sat_writing_avg._score', 'pct_students_tested',
       'academic_tier_rating'],
      dtype='object')

In [10]:
#Rename columns for clarity
df.rename(columns={'dbn': 'school_id',
    'school_name': 'school_name',
    'num_of_sat_test_takers': 'num_test_takers',
    'sat_critical_reading_avg._score': 'sat_reading',
    'sat_math_avg._score': 'sat_math',
    'sat_writing_avg._score': 'sat_writing'}, inplace=True)

In [11]:
#Convert SAT-related columns to numeric
score_cols = ['num_test_takers', 'sat_reading', 'sat_math', 'sat_writing']
for col in score_cols:
    df[col] = pd.to_numeric(df[col], errors='coerce')

In [12]:
score_cols

['num_test_takers', 'sat_reading', 'sat_math', 'sat_writing']

In [14]:
# Remove rows with missing or invalid test data
df.dropna(subset=score_cols, inplace=True)

# We can also (Impute Using School Group Averages (e.g., by Borough or Tier))

In [13]:
print(df.columns)

Index(['school_id', 'school_name', 'num_test_takers', 'sat_reading',
       'sat_math', 'sat_writing', 'pct_students_tested',
       'academic_tier_rating'],
      dtype='object')

In [20]:
#Detecting outliers

def clean_outliers(df, columns):
    """
    Removes outliers from given columns using the IQR method.
    Converts strings to numeric before processing.
    Works only on columns present in the DataFrame.
    """
    cleaned_df = df.copy()

    for col in columns:
        if col in cleaned_df.columns:
            # Convert to numeric if not already
            cleaned_df[col] = pd.to_numeric(cleaned_df[col], errors='coerce')

            # Calculate IQR
            Q1 = cleaned_df[col].quantile(0.25)
            Q3 = cleaned_df[col].quantile(0.75)
            IQR = Q3 - Q1

            # Filter out outliers
            cleaned_df = cleaned_df[
                (cleaned_df[col] >= Q1 - 1.5 * IQR) &
                (cleaned_df[col] <= Q3 + 1.5 * IQR)
            ]
        else:
            print(f"Skipping missing column: {col}")

    return cleaned_df


# Example usage:
numeric_cols = [
    'sat_reading', 'sat_math', 'sat_writing']

df_cleaned = clean_outliers(df, numeric_cols)

print(f"Original rows: {len(df)}, Cleaned rows: {len(df_cleaned)}")

Original rows: 435, Cleaned rows: 378

In [21]:
df_cleaned

,school_id,school_name,num_test_takers,sat_reading,sat_math,sat_writing,pct_students_tested,academic_tier_rating
0,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES,29.0,355.0,404.0,363.0,78%,2.0
1,01M448,UNIVERSITY NEIGHBORHOOD HIGH SCHOOL,91.0,383.0,423.0,366.0,NaN,3.0
2,01M450,EAST SIDE COMMUNITY SCHOOL,70.0,377.0,402.0,370.0,NaN,3.0
3,01M458,FORSYTH SATELLITE ACADEMY,7.0,414.0,401.0,359.0,92%,4.0
4,01M509,MARTA VALLE HIGH SCHOOL,44.0,390.0,433.0,384.0,92%,2.0
...,...,...,...,...,...,...,...,...
488,27Q480,JOHN ADAMS HIGH SCHOOL,403.0,391.0,409.0,392.0,92%,1.0
489,13K605,GEORGE WESTINGHOUSE CAREER AND TECHNICAL EDUCA...,85.0,406.0,391.0,392.0,NaN,NaN
490,05M304,MOTT HALL HIGH SCHOOL,54.0,413.0,399.0,398.0,78%,2.0
491,02M520,MURRY BERGTRAUM HIGH SCHOOL FOR BUSINESS CAREERS,264.0,407.0,440.0,393.0,92%,2.0
492,07X221,SOUTH BRONX PREPARATORY: A COLLEGE BOARD SCHOOL,65.0,364.0,378.0,348.0,92%,NaN

In [22]:
df_cleaned.describe(include='all')

,school_id,school_name,num_test_takers,sat_reading,sat_math,sat_writing,pct_students_tested,academic_tier_rating
count,378,378,378.000000,378.000000,378.000000,378.000000,290,314.000000
unique,364,364,NaN,NaN,NaN,NaN,3,NaN
top,02M520,MURRY BERGTRAUM HIGH SCHOOL FOR BUSINESS CAREERS,NaN,NaN,NaN,NaN,78%,NaN
freq,3,3,NaN,NaN,NaN,NaN,99,NaN
mean,NaN,NaN,92.050265,387.719577,396.904762,379.690476,NaN,2.589172
std,NaN,NaN,109.899907,31.311063,37.202385,30.602820,NaN,1.121961
min,NaN,NaN,6.000000,300.000000,312.000000,300.000000,NaN,1.000000
25%,NaN,NaN,39.000000,367.000000,371.000000,359.000000,NaN,2.000000
50%,NaN,NaN,59.000000,387.000000,391.000000,378.000000,NaN,3.000000
75%,NaN,NaN,84.000000,406.000000,419.000000,397.750000,NaN,4.000000
max,NaN,NaN,762.000000,471.000000,499.000000,459.000000,NaN,4.000000

In [23]:
#Normalize % tested
def convert_pct_as_int(val):
    if isinstance(val, str) and '%' in val:
        try:
            return int(val.replace('%', '').strip())
        except:
            return None
    return None

df_cleaned['pct_students_tested'] = df_cleaned['pct_students_tested'].apply(convert_pct_as_int)

In [24]:
df_cleaned['pct_students_tested']

0      78.0
1       NaN
2       NaN
3      92.0
4      92.0
       ...
488    92.0
489     NaN
490    78.0
491    92.0
492    92.0
Name: pct_students_tested, Length: 378, dtype: float64

In [25]:
# Drop duplicates if any
df_cleaned.drop_duplicates(subset='school_id', inplace=True)

In [26]:
# Select final columns for upload
new_df = df_cleaned[[
    'school_id', 'school_name', 'num_test_takers',
    'sat_reading', 'sat_math', 'sat_writing',
    'pct_students_tested', 'academic_tier_rating'
]]

In [27]:
# Upload to database 
new_df.to_sql(
    name='sumi_sat_results_outliers_removal',       
    con=engine,     
    schema='nyc_schools',
    if_exists='replace',    
    index=False            
)

print("✅ Data uploaded successfully to nyc_schools.sumi_sat_results")

✅ Data uploaded successfully to nyc_schools.sumi_sat_results

In [28]:
df_cleaned.head()

,school_id,school_name,num_test_takers,sat_reading,sat_math,sat_writing,pct_students_tested,academic_tier_rating
0,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES,29.0,355.0,404.0,363.0,78.0,2.0
1,01M448,UNIVERSITY NEIGHBORHOOD HIGH SCHOOL,91.0,383.0,423.0,366.0,NaN,3.0
2,01M450,EAST SIDE COMMUNITY SCHOOL,70.0,377.0,402.0,370.0,NaN,3.0
3,01M458,FORSYTH SATELLITE ACADEMY,7.0,414.0,401.0,359.0,92.0,4.0
4,01M509,MARTA VALLE HIGH SCHOOL,44.0,390.0,433.0,384.0,92.0,2.0

In [30]:
df_cleaned.to_csv('cleaned_sat_data_outliers_removal.csv', index=False)